case/singleParticle/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0.23;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.23;
        value           uniform 0.23;
    }
}


// ************************************************************************* //
