case/singleParticle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          25;
        startFace       300;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          25;
        startFace       325;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       350;
    }
)

// ************************************************************************* //
